starter-kit-misc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Misc</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Misc</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Misc</h2>
<div class="outline-text-2" id="text-1">
<p>
Things that don't fit anywhere else.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Check Dependencies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Determine whether required packages are installed. If not, use ELPA to
install them. Other dependencies are provided by Emacs 24.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'magit)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Color Themes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Emacs24 has build in support for saving and loading themes.
</p>

<p>
A Theme builder is available at <a href="http://elpa.gnu.org/themes/">http://elpa.gnu.org/themes/</a> along with
a list of pre-built themes at <a href="http://elpa.gnu.org/themes/view.html">http://elpa.gnu.org/themes/view.html</a> and
themes are available through ELPA.
</p>

<p>
Downloaded themes may be saved to the <code>themes/</code> directory in the base
of the starter kit which ignored by git.  Once downloaded and
evaluated a theme is activated using the <code>load-theme</code> function.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Window systems</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp" id="starter-kit-window-view-stuff">(<span style="font-weight: bold;">when</span> window-system
  (setq frame-title-format '(buffer-file-name <span style="font-style: italic;">"%f"</span> (<span style="font-style: italic;">"%b"</span>)))
  (blink-cursor-mode -1)
  (<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">mwheel</span> nil 'no-error) (mouse-wheel-mode t)))

(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

(setq visible-bell t
      echo-keystrokes 0.1
      font-lock-maximum-decoration t
      inhibit-startup-message t
      transient-mark-mode t
      color-theme-is-global t
      delete-by-moving-to-trash t
      shift-select-mode nil
      truncate-partial-width-windows nil
      uniquify-buffer-name-style 'forward
      whitespace-style '(trailing lines space-before-tab
                                  indentation space-after-tab)
      whitespace-line-column 100
      ediff-window-setup-function 'ediff-setup-windows-plain
      oddmuse-directory (concat starter-kit-dir <span style="font-style: italic;">"oddmuse"</span>)
      xterm-mouse-mode t
      save-place-file (concat starter-kit-dir <span style="font-style: italic;">"places"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Transparently open compressed files</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(auto-compression-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Save a list of recent files visited.</h3>
<div class="outline-text-3" id="text-1-5">
<p>
#+begin_src emacs-lisp 
(recentf-mode 1)
#+end_src emacs-lisp
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Highlight matching parentheses when the point is on them.</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp" id="starter-kit-match-parens">(show-paren-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">ido mode</h3>
<div class="outline-text-3" id="text-1-7">
<p>
ido-mode is like magic pixie dust!
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp" id="starter-kit-loves-ido-mode">(<span style="font-weight: bold;">when</span> (&gt; emacs-major-version 21)
  (ido-mode t)
  (setq ido-enable-prefix nil
        ido-enable-flex-matching t
        ido-create-new-buffer 'always
        ido-use-filename-at-point t
        ido-max-prospects 10))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">Other, spell checking, tabs, imenu and a coding hook</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-default 'indent-tabs-mode nil)
(set-default 'indicate-empty-lines t)
(set-default 'imenu-auto-rescan t)

(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'text-mode-hook 'turn-on-flyspell)

(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">starter-kit-coding-hook</span> nil
  <span style="font-style: italic;">"Hook that gets run on activation of any programming mode."</span>)

(<span style="font-weight: bold;">defalias</span> '<span style="font-weight: bold;">yes-or-no-p</span> 'y-or-n-p)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Seed the random-number generator</span>
(random t)
</pre>
</div>
</div>

<div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1">functions for prettier source code</h4>
<div class="outline-text-4" id="text-1-8-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">starter-kit-pretty-lambdas</span> ()
  (font-lock-add-keywords
   nil `((<span style="font-style: italic;">"(</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">lambda\\&gt;</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">"</span>
          (0 (<span style="font-weight: bold;">progn</span> (compose-region (match-beginning 1) (match-end 1)
                                    ,(make-char 'greek-iso8859-7 107))
                    nil))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8-2" class="outline-4">
<h4 id="sec-1-8-2">possible issues/resolutions with flyspell</h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
Most of the solution came from <a href="http://www.emacswiki.org/emacs/FlySpell">EmacsWiki-FlySpell</a>.  Here is one
possible fix.
</p>
</div>

<ul class="org-ul"><li><a id="sec-1-8-2-1" name="sec-1-8-2-1"></a>Emacs set path to aspell<br  /><div class="outline-text-5" id="text-1-8-2-1">
<p>
it's possible aspell isn't in your path
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq exec-path (append exec-path '(<span style="font-style: italic;">"/opt/local/bin"</span>)))
</pre>
</div>
</div>
</li>

<li><a id="sec-1-8-2-2" name="sec-1-8-2-2"></a>Emacs specify spelling program<br  /><div class="outline-text-5" id="text-1-8-2-2">
<ul class="org-ul">
<li>This didn't work at first, possibly because cocoAspell was
building its dictionary.  Now it seems to work fine.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ispell-program-name <span style="font-style: italic;">"aspell"</span>
      ispell-dictionary <span style="font-style: italic;">"english"</span>
      ispell-dictionary-alist
      (<span style="font-weight: bold;">let</span> ((default '(<span style="font-style: italic;">"[A-Za-z]"</span> <span style="font-style: italic;">"[</span><span style="font-style: italic;">^</span><span style="font-style: italic;">A-Za-z]"</span> <span style="font-style: italic;">"[']"</span> nil
                       (<span style="font-style: italic;">"-B"</span> <span style="font-style: italic;">"-d"</span> <span style="font-style: italic;">"english"</span> <span style="font-style: italic;">"--dict-dir"</span>
                        <span style="font-style: italic;">"/Library/Application Support/cocoAspell/aspell6-en-6.0-0"</span>)
                       nil iso-8859-1)))
        `((nil ,@default)
          (<span style="font-style: italic;">"english"</span> ,@default))))
</pre>
</div>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">Hippie expand: at times perhaps too hip</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">when</span> (boundp 'hippie-expand-try-functions-list)
  (delete 'try-expand-line hippie-expand-try-functions-list)
  (delete 'try-expand-list hippie-expand-try-functions-list))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">Don't clutter up directories with files~</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Rather than saving backup files scattered all over the file system,
let them live in the <code>backups/</code> directory inside of the starter kit.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq backup-directory-alist `((<span style="font-style: italic;">"."</span> . ,(expand-file-name
                                        (concat starter-kit-dir <span style="font-style: italic;">"backups"</span>)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">Default to unified diffs</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq diff-switches <span style="font-style: italic;">"-u"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">Cosmetics</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'diff-mode
  '(<span style="font-weight: bold;">progn</span>
     (set-face-foreground 'diff-added <span style="font-style: italic;">"green4"</span>)
     (set-face-foreground 'diff-removed <span style="font-style: italic;">"red3"</span>)))

(eval-after-load 'magit
  '(<span style="font-weight: bold;">progn</span>
     (set-face-foreground 'magit-diff-add <span style="font-style: italic;">"green3"</span>)
     (set-face-foreground 'magit-diff-del <span style="font-style: italic;">"red3"</span>)))
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
